from sympy import Symbol, solve
from sympy.plotting import plot,plot3d
import matplotlib.pyplot as plt
import numpy as np 

print("------------------------------4번------------------------------")
print('(a) 각 동전의 합이 3달러이면, 각 동전의 개수는 각각 몇 개인가?')
print('%30s'% 'x1 + x2 + x3 = 20')
print('%30s'% '2x1 - x2 = 0')
print('%32s'% '5x1 + 10x2 + 25x3 = 300\n')

ex = [ [1, 1, 1, 20],
       [2, -1, 0, 0],
       [5, 10, 25, 300]]

x1 = Symbol('x1')
x2 = Symbol('x2')
x3 = Symbol('x3')

e1 = ex[0][0]*x1 + ex[0][1]*x2 + ex[0][2]*x3 -20
e2 = ex[1][0]*x1 + ex[1][1]*x2 + ex[1][2]*x3
e3 = ex[2][0]*x1 + ex[2][1]*x2 + ex[2][2]*x3 -300

print(' ∴')
print('해가 없다.\n') if len(solve([e1,e2,e3])) == 0 else print(solve([e1,e2,e3]))
print("따라서 5센트 짜리 동전 4개, 10센트 짜리 동전 8개, 25센트 짜리 동전 8개이다.")

print('\n(b)) 5센트, 10센트, 25센트짜리 동전들의 개수의 합이 스무 개이고 금액이 3달러인 모든 가능한 경우를 구하라.')
print('%30s'% 'x1 + x2 + x3 = 20')
print('%32s'% '5x1 + 10x2 + 25x3 = 300\n')

ex = [ [1, 1, 1, 20],
       [5, 10, 25, 300]]

e1 = ex[0][0]*x1 + ex[0][1]*x2 + ex[0][2]*x3 -20
e2 = ex[1][0]*x1 + ex[1][1]*x2 + ex[1][2]*x3 - 300

print(' ∴')
print('해가 없다.\n') if len(solve([e1,e2])) == 0 else print(solve([e1,e2]))
print('\nx3을 t로 치환하면 7 <= t <= 10의 범위를 구할 수 있다. t=7,8,9,10 이므로 ')
print('x1,x2,x3 = [1,12,7],[4,8,8],[7,4,9],[10,0,10]이다')


print("------------------------------20번------------------------------")
print('전기회로망에 전류를 구하라.')
print('%30s'% 'I1 - I2 + I3 = 0')
print('%30s'% 'I1 - 2I2 = 5')
print('%32s'% '2I2 + 4I3 = 300\n')

ex = [ [1, -1, 1, 0],
       [1, 2, 0, 5],
       [0, 2, 4, 8]]

I1 = Symbol('I1')
I2 = Symbol('I2')
I3 = Symbol('I3')

e1 = ex[0][0]*I1 + ex[0][1]*I2 + ex[0][2]*I3 
e2 = ex[1][0]*I1 + ex[1][1]*I2 + ex[1][2]*I3 -5
e3 = ex[2][0]*I1 + ex[2][1]*I2 + ex[2][2]*I3 -8

print(' ∴')
print('해가 없다.\n') if len(solve([e1,e2,e3])) == 0 else print(solve([e1,e2,e3]))
print('따라서 I1 = 1, I2 = 2, I3 = 1이다.')


print("------------------------------43번------------------------------")
print('다음의 각 덧셈표가 성립하도록 가능한 a, b, c, d, e, f의 값을 구하라.')
print(' (a)')

ex = [ [1, 0, 0, 1, 0, 0,  3],
       [1, 0, 0, 0, 1, 0,  5],
       [1, 0, 0, 0, 0, 1,  4],
       [0, 1, 0, 1, 0, 0,  2],
       [0, 1, 0, 0, 1, 0,  4],
       [0, 1, 0, 0, 0, 1,  3],
       [0, 0, 1, 1, 0, 0,  1],
       [0, 0, 1, 0, 1, 0,  3],
       [0, 0, 1, 0, 0, 1,  1]]

for i in ex :
    print(i)

a = Symbol('a')
b = Symbol('b')
c = Symbol('c')
d = Symbol('d')
e = Symbol('e')
f = Symbol('f')

e1 = ex[0][0]*a + ex[0][1]*b + ex[0][2]*c + ex[0][3]*d + ex[0][4]*e + ex[0][5]*f - ex[0][6]
e2 = ex[1][0]*a + ex[1][1]*b + ex[1][2]*c + ex[1][3]*d + ex[1][4]*e + ex[1][5]*f - ex[1][6]
e3 = ex[2][0]*a + ex[2][1]*b + ex[2][2]*c + ex[2][3]*d + ex[2][4]*e + ex[2][5]*f - ex[2][6]
e4 = ex[3][0]*a + ex[3][1]*b + ex[3][2]*c + ex[3][3]*d + ex[3][4]*e + ex[3][5]*f - ex[3][6]
e5 = ex[4][0]*a + ex[4][1]*b + ex[4][2]*c + ex[4][3]*d + ex[4][4]*e + ex[4][5]*f - ex[4][6]
e6 = ex[5][0]*a + ex[5][1]*b + ex[5][2]*c + ex[5][3]*d + ex[5][4]*e + ex[5][5]*f - ex[5][6]
e7 = ex[6][0]*a + ex[6][1]*b + ex[6][2]*c + ex[6][3]*d + ex[6][4]*e + ex[6][5]*f - ex[6][6]
e8 = ex[7][0]*a + ex[7][1]*b + ex[7][2]*c + ex[7][3]*d + ex[7][4]*e + ex[7][5]*f - ex[7][6]
e9 = ex[8][0]*a + ex[8][1]*b + ex[8][2]*c + ex[8][3]*d + ex[8][4]*e + ex[8][5]*f - ex[8][6]

print('\n ∴')
print('해가 없다.\n') if len(solve([e1,e2,e3,e4,e5,e6,e7,e8,e9])) == 0 else print(solve([e1,e2,e3,e4,e5,e6,e7,e8,e9]))


print(' (b)')
ex = [ [1, 0, 0, 1, 0, 0,  1],
       [1, 0, 0, 0, 1, 0,  3],
       [1, 0, 0, 0, 0, 1,  4],
       [0, 1, 0, 1, 0, 0,  2],
       [0, 1, 0, 0, 1, 0,  4],
       [0, 1, 0, 0, 0, 1,  5],
       [0, 0, 1, 1, 0, 0,  3],
       [0, 0, 1, 0, 1, 0,  5],
       [0, 0, 1, 0, 0, 1,  6]]

e1 = ex[0][0]*a + ex[0][1]*b + ex[0][2]*c + ex[0][3]*d + ex[0][4]*e + ex[0][5]*f - ex[0][6]
e2 = ex[1][0]*a + ex[1][1]*b + ex[1][2]*c + ex[1][3]*d + ex[1][4]*e + ex[1][5]*f - ex[1][6]
e3 = ex[2][0]*a + ex[2][1]*b + ex[2][2]*c + ex[2][3]*d + ex[2][4]*e + ex[2][5]*f - ex[2][6]
e4 = ex[3][0]*a + ex[3][1]*b + ex[3][2]*c + ex[3][3]*d + ex[3][4]*e + ex[3][5]*f - ex[3][6]
e5 = ex[4][0]*a + ex[4][1]*b + ex[4][2]*c + ex[4][3]*d + ex[4][4]*e + ex[4][5]*f - ex[4][6]
e6 = ex[5][0]*a + ex[5][1]*b + ex[5][2]*c + ex[5][3]*d + ex[5][4]*e + ex[5][5]*f - ex[5][6]
e7 = ex[6][0]*a + ex[6][1]*b + ex[6][2]*c + ex[6][3]*d + ex[6][4]*e + ex[6][5]*f - ex[6][6]
e8 = ex[7][0]*a + ex[7][1]*b + ex[7][2]*c + ex[7][3]*d + ex[7][4]*e + ex[7][5]*f - ex[7][6]
e9 = ex[8][0]*a + ex[8][1]*b + ex[8][2]*c + ex[8][3]*d + ex[8][4]*e + ex[8][5]*f - ex[8][6]

for i in ex :
    print(i)

print('\n ∴')
print('해가 없다.') if len(solve([e1,e2,e3,e4,e5,e6,e7,e8,e9])) == 0 else print(solve([e1,e2,e3,e4,e5,e6,e7,e8,e9]))
